workspace/DataProcessors/АукРабочийСтолАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АукРабочийСтолАукционы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

workspace/InformationRegisters/АукШаблоныСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>АукШаблоныСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстШаблона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗаголовка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АдресатСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АукАдресатыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

workspace/Enums/АукСтатусыАукционов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>АукСтатусыАукционов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеПромежуточныхИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НовыйЭтап</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодведениеИтогов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

workspace/Catalogs/АукАукционы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>АукАукционы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидАукциона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукВидыАукционов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийАукцион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АукАукционы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийСтарт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеПромежуточныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическийПереходКПодведениюОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеПодведениеОкончательныхИтогов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Участники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукКонтактныеЛицаУчастниковАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АукУчастникиАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаНачальныхДанных</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементНачальныхДанных</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНачальныхДанных</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьДни</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЧасы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.АукЭлементыДанныхАукционов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПараметра</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.АукЭлементыДанныхАукционов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

workspace/DataProcessors/АукРабочийСтолАукционы/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПодпискиНаСобытияФорм.Обработка_ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	НачальнаяИнициализация();
	
	ПодпискиНаСобытияФорм.Обработка_ПослеСозданияНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодпискиНаСобытияФормКлиент.Обработка_ПриОткрытии(ЭтотОбъект, Отказ);
	Если (Отказ) Тогда
		Возврат;
	КонецЕсли;

	НастроитьОформлениеКнопокОтбораПоТекущемуПользователю();
	
	ПодключитьОбработчикОжидания("ОбновитьСписокАукционов", 20);
	
	ПодпискиНаСобытияФормКлиент.Обработка_ПослеОткрытия(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура дсАукционыВРаботеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбработатьКопированиеАукциона(Копирование, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыВРаботеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
		Если ТекДанные.Автор = ЭтотОбъект.ТекущийПользователь Тогда	
			
			ОткрытьКарточкуАукциона(ТекДанные.Аукцион);
			
		Иначе
			
			Оповещение = Новый ОписаниеОповещения("ОткрытиеКарточкиАукциона_Продолжить", ЭтотОбъект, ТекДанные.Аукцион); 
			
			стрТекстВопроса = НСтр("ru = 'Автором данного аукциона является другой пользователь. Вы точно хотите окрыть карточку аукциона для возможного редактирования?'");
			
			ПоказатьВопрос(Оповещение, стрТекстВопроса, РежимДиалогаВопрос.ДаНет,,, НСтр("ru = 'Предупреждение'")); 	
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеКарточкиАукциона_Продолжить(Результат, пАукцион) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ОткрытьКарточкуАукциона(пАукцион);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыВРаботеПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		
		НастроитьВидимостьКомандВЗависимостиОтСтатусаАукциона(ТекДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыПодведениеИтоговПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	ОбработатьКопированиеАукциона(Копирование, Отказ);	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыПодведениеИтоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элемент.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		
		ОткрытьКарточкуАукциона(ТекДанные.Аукцион);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыЗавершенныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)	
	ОбработатьКопированиеАукциона(Копирование, Отказ);	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыАрхивПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбработатьКопированиеАукциона(Копирование, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)		
	ОбновитьСписокАукционов();	
КонецПроцедуры

&НаКлиенте
Процедура дсАукционыОтмененныеПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	ОбработатьКопированиеАукциона(Копирование, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСправочникУчастникиАукционаНажатие(Элемент)
	ОткрытьФорму("Справочник.АукУчастникиАукционов.ФормаСписка",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСправочникДопЭлементыДанныхАукционовНажатие(Элемент)
	ОткрытьФорму("Справочник.АукДопЭлементыДанныхАукционов.ФормаСписка",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаРегистрСведенийШаблоныСообщенийНажатие(Элемент)
	ОткрытьФорму("РегистрСведений.АукШаблоныСообщений.ФормаСписка",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

&НаКлиенте
Процедура СсылкаСправочникВидыАукционовНажатие(Элемент)
	ОткрытьФорму("Справочник.АукВидыАукционов.ФормаСписка",,,,,,, РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура СписокНовыеПеревестиВРаботу(Команда)
	ПеревестиВРаботуНовыйАукцион();
КонецПроцедуры

&НаКлиенте
Процедура СписокНовыеОтборПоТекущемуПользователю(Команда)	
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыНовые");
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеОтборПоТекущемуПользователю(Команда)	
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыВРаботе");	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодведениеИтоговОтборПоТекущемуПользователю(Команда)	
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыПодведениеИтогов");	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗавершенныеОтборПоТекущемуПользователю(Команда)	
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыЗавершенные");	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеКопирование(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеВводНовойСтавки(Команда)
	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Оповещение = Новый ОписаниеОповещения("ВводНовойСтавки_Продолжить", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
		ПараметрыФормы.Вставить("ВидАукциона",		ТекДанные.ВидАукциона);
		
		ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ВводСтавкиУчастника", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНовойСтавки_Продолжить(пСткДанныеСтавки, ДополнительныеПараметры) Экспорт
	
	Если пСткДанныеСтавки <> Неопределено Тогда
		
		АукОбщийКлиент.ЗафиксироватьДанныеСтавки(пСткДанныеСтавки);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеВводИнформацииОбОтказеОтУчастия(Команда)
	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Оповещение = Новый ОписаниеОповещения("ВводОтказа_Продолжить", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
		
		ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ВводИнформацииОбОтказе", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводОтказа_Продолжить(пСткДанныеОтказа, ДополнительныеПараметры) Экспорт
	
	Если пСткДанныеОтказа <> Неопределено Тогда
		
		АукОбщийКлиент.ЗафиксироватьОтказОтУчастия(пСткДанныеОтказа);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеВводИнформационногоСообщения(Команда)
	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Оповещение = Новый ОписаниеОповещения("ВводСообщенияОтУчастника_Продолжить", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
		
		ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ВводВходящегоСообщения", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСообщенияОтУчастника_Продолжить(пСткСообщение, ДополнительныеПараметры) Экспорт
	
	Если пСткСообщение <> Неопределено Тогда
		
		АукОбщийКлиент.ЗафиксироватьСообщениеОтУчастника(пСткСообщение);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПерейтиКРасчетуПромежуточныхИтогов(Команда)	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("Аукцион",	ТекДанные.Аукцион);
		сткПараметры.Вставить("НомерЭтапа",	ТекДанные.НомерЭтапа);
		
		Если АукОбщийКлиент.АукционПереведенНаПодведениеПромежуточныхИтогов(сткПараметры) Тогда
			
			ПеревестиАукционНаСледующийЭтап(ТекДанные);
	
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПерейтиКРасчетуОкончательныхИтогов(Команда)
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		сткПараметры = Новый Структура;
		сткПараметры.Вставить("Аукцион",	ТекДанные.Аукцион);
		сткПараметры.Вставить("НомерЭтапа",	ТекДанные.НомерЭтапа);
		
		Если АукОбщийКлиент.АукционПереведенНаПодведениеОкончательныхИтогов(сткПараметры) Тогда
			
			ПеревестиАукционНаСледующийЭтап(ТекДанные);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеОтправитьСообщениеУчастникам(Команда)	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Оповещение = Новый ОписаниеОповещения("ОтправитьСообщениеУчастникам_Продолжить", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
		
		ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ОтправкаСообщенияУчастникам", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодведениеИтоговОтправитьСообщениеУчастникам(Команда)
	ТекДанные = Элементы.дсАукционыПодведениеИтогов.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Оповещение = Новый ОписаниеОповещения("ОтправитьСообщениеУчастникам_Продолжить", ЭтотОбъект);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
		
		ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ОтправкаСообщенияУчастникам", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеУчастникам_Продолжить(пСткДанныеСообщения, ДополнительныеПараметры) Экспорт
	
	Если пСткДанныеСообщения <> Неопределено Тогда
		
		АукОбщийКлиент.ОтправитьСообщениеУчастникам(пСткДанныеСообщения);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВРаботеПодведениеПромежуточныхИтогов(Команда)	
	ОткрытьФормуПромежуточногоПодведенияИтогов();	
КонецПроцедуры

&НаКлиенте
Процедура СписокПодведениеИтогов2(Команда)	
	ОткрытьФормуПодведенияОбщихИтогов();	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗавершенныеПоказатьИтоги(Команда)
	ПроказатьИтогиПоТекущейСтрокеСписка("дсАукционыЗавершенные");	
КонецПроцедуры

&НаКлиенте
Процедура СписокАрхивПоказатьИтоги(Команда)
	
	ПроказатьИтогиПоТекущейСтрокеСписка("дсАукционыАрхив");

КонецПроцедуры

&НаКлиенте
Процедура СписокЗавершенныеВАрхив(Команда)
	
	ПеревестиВАрхивЗавершенныйАукцион();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокАрхивОтборПоТекущемуПользователю(Команда)	
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыАрхив");	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИсториюСтавокПоСтроке(Команда)
	// Активная страница
	стрСтраница = Элементы.Страницы.ТекущаяСтраница.Имя;
	
	ТекДанные = Элементы[СтрЗаменить(стрСтраница, "Страница", "дсАукционы")].ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		ОткрытьИсториюСтавок(ТекДанные);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СписокВРаботеОтменитьАукцион(Команда)
	стрТекстВопроса = НСтр("ru = 'Вы уверены, что хотите отменить аукцион?'");
	
	Ответ = Ждать ВопросАсинх(стрТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
			Если АукОбщийКлиент.АукционОтменен(ТекДанные.Аукцион) Тогда
				ПеревестиАукционВОтмененные();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОтмененныеОтборПоТекущемуПользователю(Команда)
	УстановитьСнятьОтборВСпискеПоТекущемуПользователю("дсАукционыОтмененные");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьКопированиеАукциона(пКопирование, пОтказ)
	Если Не пКопирование Тогда
		пОтказ = Истина;
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНовые;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьСписокАукционов()
	
	ТекСтраница = Элементы.Страницы.ТекущаяСтраница;	
	
	Если ЭтоСлужебнаяСтраница(ТекСтраница.Имя) Тогда
		Возврат;	
	КонецЕсли;	
	
	Элементы[СтрЗаменить(ТекСтраница.Имя, "Страница", "дсАукционы")].Обновить();
	
	Если ТекСтраница.Имя = "СтраницаВРаботе" Тогда
		ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
			НастроитьВидимостьКомандВЗависимостиОтСтатусаАукциона(ТекДанные);
		Иначе	
			СкрытьПоказатьЭлементыФормы(ВРаботе_ВсеКомандыУправления(), Ложь);	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ЭтоСлужебнаяСтраница(пСтраницаИмя)
	Возврат пСтраницаИмя = "СтраницаАдминистрирование"; 	
КонецФункции	

&НаКлиенте
Процедура ПроказатьИтогиПоТекущейСтрокеСписка(пИмяСписка)
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		ТекДанные = Элементы[пИмяСписка].ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",		ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",	ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("НомерЭтапа",	ТекДанные.НомерЭтапа);
			ПараметрыФормы.Вставить("Статус",		ТекДанные.Статус);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеИтогов3", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;	
	Иначе	
		ТекДанные = Элементы[пИмяСписка].ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",		ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("ТолькоПросмотр",	Истина);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеИтогов2", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьИсториюСтавок(пТекДанные)

	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("Аукцион",		пТекДанные.Аукцион);
	ПараметрыФормы.Вставить("ВидАукциона",	пТекДанные.ВидАукциона);
	
	ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПросмотрИсторииСтавок2", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьКарточкуАукциона(пАукцион)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", пАукцион);
	
	ОткрытьФорму("Справочник.АукАукционы.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект, Новый УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОткрытьФормуПодведенияОбщихИтогов() 
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда
		ТекДанные = Элементы.дсАукционыПодведениеИтогов.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда	
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",		ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",	ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("НомерЭтапа",	ТекДанные.НомерЭтапа);
			ПараметрыФормы.Вставить("Статус",		ТекДанные.Статус);
			
			Оповещение = Новый ОписаниеОповещения("ПодведениеОбщихИтогов_Продолжить", ЭтотОбъект, ТекДанные);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеИтогов3", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
		КонецЕсли;	
	Иначе
		ТекДанные = Элементы.дсАукционыПодведениеИтогов.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",		ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",	ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("НомерЭтапа",	ТекДанные.НомерЭтапа);
			
			Оповещение = Новый ОписаниеОповещения("ПодведениеОбщихИтогов_Продолжить", ЭтотОбъект, ТекДанные);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеИтогов2", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПодведениеОбщихИтогов_Продолжить(Результат, пТекДанные) Экспорт  
		
	Если Результат = Истина Тогда		
		Если АукОбщийКлиент.ОкончательныеИтогиЗафиксированы(пТекДанные.Аукцион) Тогда
			
			ПеревестиВЗавершенные(пТекДанные);
			
		КонецЕсли;		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПромежуточногоПодведенияИтогов() 
	Если АукОбщийКлиентСервер.НовыРасчетИтогаВключен() Тогда	
		ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",		ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("НомерЭтапа",		ТекДанные.НомерЭтапа);
			ПараметрыФормы.Вставить("Статус",			ТекДанные.Статус);
			
			Оповещение = Новый ОписаниеОповещения("ПодведениеПромежуточныхИтогов_Продолжить", ЭтотОбъект, ТекДанные);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеИтогов3", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	Иначе	
		ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
		
		Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Аукцион",			ТекДанные.Аукцион);
			ПараметрыФормы.Вставить("ВидАукциона",		ТекДанные.ВидАукциона);
			ПараметрыФормы.Вставить("НомерЭтапа",		ТекДанные.НомерЭтапа);
			
			Оповещение = Новый ОписаниеОповещения("ПодведениеПромежуточныхИтогов_Продолжить", ЭтотОбъект, ТекДанные);
			
			ОткрытьФорму("Обработка.АукРабочийСтолАукционы.Форма.ПодведениеПромежуточныхИтогов", ПараметрыФормы, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодведениеПромежуточныхИтогов_Продолжить(Результат, пТекДанные) Экспорт  
		
	Если Результат = Истина Тогда
		//пСткДанные.Вставить("НомерЭтапа", пТекДанные.НомерЭтапа);
		
		Если АукОбщийКлиент.ПромежуточныйИтогЗафиксирован(пТекДанные.Аукцион) Тогда
			
			ПеревестиАукционНаСледующийЭтап(пТекДанные);
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьОтборВСпискеПоТекущемуПользователю(пИмяСписка)
	ЭлСзАктивностьОтбора = ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.НайтиПоЗначению(пИмяСписка);
	
	Если ЭлСзАктивностьОтбора.Пометка Тогда
		УдалитьОтборВСпискеПоТекущемуПользователю(пИмяСписка);
		
		Элементы[пИмяСписка + "ОтборПоТекущемуПользователю"].ЦветРамки = Новый Цвет();
		
		ЭлСзАктивностьОтбора.Пометка = Ложь;
	Иначе
		УстановитьОтборВСпискеПоТекущемуПользователю(пИмяСписка);
		
		Элементы[пИмяСписка + "ОтборПоТекущемуПользователю"].ЦветРамки = WebЦвета.НасыщенноНебесноГолубой;
		
		ЭлСзАктивностьОтбора.Пометка = Истина;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьОформлениеКнопокОтбораПоТекущемуПользователю()
	Для Каждого ЭлСз Из ЭтотОбъект.ОтборПоТекущемуПользователюАктивность Цикл
		ОтборКомпоновкиДанных = АукОбщийКлиентСервер.ЭлементПользовательскихНастроекКомпоновкиДанныхПоТипу(ЭтотОбъект[ЭлСз.Значение], Тип("ОтборКомпоновкиДанных"));
		
		ЭлементыГруппаТекПользователь = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
											ОтборКомпоновкиДанных,, "Текущий пользователь");
		
		Если ЗначениеЗаполнено(ЭлементыГруппаТекПользователь) Тогда
			Элементы[ЭлСз.Значение + "ОтборПоТекущемуПользователю"].ЦветРамки = WebЦвета.НасыщенноНебесноГолубой;
			
			ЭлСз.Пометка = Истина;												
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьОтборВСпискеПоТекущемуПользователю(пИмяСписка)
	
	ОтборКомпоновкиДанных = АукОбщийКлиентСервер.ЭлементПользовательскихНастроекКомпоновкиДанныхПоТипу(ЭтотОбъект[пИмяСписка], Тип("ОтборКомпоновкиДанных"));
	
	Если ОтборКомпоновкиДанных = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка установки отбора!'"));	
	КонецЕсли;
	
	ГруппаТекПользователь = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
									ОтборКомпоновкиДанных.Элементы,
									"Текущий пользователь",
									ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
									ГруппаТекПользователь,
									"Автор",
									ВидСравненияКомпоновкиДанных.Равно,
									ЭтотОбъект.ТекущийПользователь,
									,
									Истина,
									РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);   
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
									ГруппаТекПользователь,
									"АвторИзменения",
									ВидСравненияКомпоновкиДанных.Равно,
									ЭтотОбъект.ТекущийПользователь,
									,
									Истина,
									РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
				
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОтборВСпискеПоТекущемуПользователю(пИмяСписка)
	ОтборКомпоновкиДанных = АукОбщийКлиентСервер.ЭлементПользовательскихНастроекКомпоновкиДанныхПоТипу(ЭтотОбъект[пИмяСписка], Тип("ОтборКомпоновкиДанных"));
	
	ЭлементыГруппаТекПользователь = ОбщегоНазначенияКлиентСервер.НайтиЭлементыИГруппыОтбора(
									ОтборКомпоновкиДанных,, "Текущий пользователь");
	
	Для Каждого ЭлементОтбора Из ЭлементыГруппаТекПользователь Цикл
		ОтборКомпоновкиДанных.Элементы.Удалить(ЭлементОтбора);
	КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ПеревестиВЗавершенные(пТекДанные)
	
	Элементы.дсАукционыПодведениеИтогов.Обновить();
	Элементы.дсАукционыЗавершенные.Обновить();
	
	ПереключитьВкладкуИСпозиционироваться(пТекДанные.Аукцион, "СтраницаЗавершенные", "дсАукционыЗавершенные");	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиАукционВОтмененные()
	
	ТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Элементы.дсАукционыВРаботе.Обновить();
		Элементы.дсАукционыОтмененные.Обновить();
		
		ПереключитьВкладкуИСпозиционироваться(ТекДанные.Аукцион, "СтраницаОтмененные", "дсАукционыОтмененные");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиВРаботуНовыйАукцион()
	
	ТекДанные = Элементы.дсАукционыНовые.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		Если Не ТекДанные.ПометкаУдаления Тогда
			сткДанныеАукциона = АукОбщийВызовСервера.ДанныеАукционаДляПроверки(ТекДанные.Аукцион);
			
			Оповещение = Новый ОписаниеОповещения("АукционПереведенВРаботу_Продолжить", ЭтотОбъект, ТекДанные);
			
			АукОбщийКлиент.ВыполнитьПроверкиНастроекАукциона(сткДанныеАукциона, Оповещение);		
			
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Нельзя перевести в работу помеченный на удаление аукцион.'"));
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АукционПереведенВРаботу_Продолжить(Результат, ТекДанные) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если АукОбщийКлиент.АукционПереведенВРаботу(ТекДанные.Аукцион) Тогда	
			Элементы.дсАукционыНовые.Обновить();
			Элементы.дсАукционыВРаботе.Обновить();
			
			ПереключитьВкладкуИСпозиционироваться(ТекДанные.Аукцион, "СтраницаВРаботе", "дсАукционыВРаботе");	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПеревестиВАрхивЗавершенныйАукцион()
	
	ТекДанные = Элементы.дсАукционыЗавершенные.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Не ТекДанные.Свойство("ГруппировкаСтроки") Тогда
		
		Если АукОбщийКлиент.АукционПомещенВАрхив(ТекДанные.Аукцион) Тогда
			
			Элементы.дсАукционыЗавершенные.Обновить();
			Элементы.дсАукционыАрхив.Обновить();
			
			ПереключитьВкладкуИСпозиционироваться(ТекДанные.Аукцион, "СтраницаАрхив", "дсАукционыАрхив");
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПереключитьВкладкуИСпозиционироваться(пТекАукцион, пИмяВкладки, пИмяСписка)

	Элементы.Страницы.ТекущаяСтраница = Элементы[пИмяВкладки];
	
	Элементы[пИмяСписка].ТекущаяСтрока = пТекАукцион;
	
КонецПроцедуры	

&НаСервере
Процедура НачальнаяИнициализация()
	
	ЭтотОбъект.ТекущийПользователь = ПараметрыСеанса.глТекПользователь;
		
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыНовые",, Ложь);
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыВРаботе",, Ложь);
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыПодведениеИтогов",, Ложь);
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыЗавершенные",, Ложь);
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыАрхив",, Ложь);
	ЭтотОбъект.ОтборПоТекущемуПользователюАктивность.Добавить("дсАукционыОтмененные",, Ложь);
			
КонецПроцедуры	

&НаКлиенте
Процедура ПеревестиАукционНаСледующийЭтап(пТекДанные)
	
	Элементы.дсАукционыВРаботе.Обновить();
	
	НовТекДанные = Элементы.дсАукционыВРаботе.ТекущиеДанные;
	
	Если НовТекДанные <> Неопределено Тогда
		НастроитьВидимостьКомандВЗависимостиОтСтатусаАукциона(НовТекДанные);
	КонецЕсли;
	
	Если пТекДанные.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.НовыйЭтап")
		И пТекДанные.НомерЭтапа = пТекДанные.КоличествоЭтапов
	Тогда	 
		
		Элементы.дсАукционыПодведениеИтогов.Обновить();
		
		ПереключитьВкладкуИСпозиционироваться(пТекДанные.Аукцион, "СтраницаПодведениеИтогов", "дсАукционыПодведениеИтогов");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьКомандВЗависимостиОтСтатусаАукциона(пТекДанные)
	
	Если пТекДанные.ПометкаУдаления Тогда
		СкрытьПоказатьЭлементыФормы(ВРаботе_ВсеКомандыУправления(), Ложь);	
	Иначе
		// Может быть только 2 возможных статуса ПодведениеПромежуточныхИтогов и НовыйЭтап
		Если пТекДанные.Статус = ПредопределенноеЗначение("Перечисление.АукСтатусыАукционов.ПодведениеПромежуточныхИтогов") Тогда
			
			СкрытьПоказатьЭлементыФормы(ПодведениеПромежуточныхИтогов_ЭлементыДляСкрытия(), Ложь); 
			
			СкрытьПоказатьЭлементыФормы("дсАукционыВРаботеСписокВРаботеПодведениеПромежуточныхИтогов", Истина);
			
		Иначе
			// Для статуса НовыйЭтап возможны 2 варианта:
			//	1. Этап аукциона не максимальный -> видна кнопка перехода к промежуточным итогам
			//	2. Этап аукциона максимальный -> видна кнопка перехода к окончательным итогам
			
			Если пТекДанные.НомерЭтапа < пТекДанные.КоличествоЭтапов Тогда	
				СкрытьПоказатьЭлементыФормы(ЭлементыДляВзаимодействияСУчастниками(), Истина);
				
				СкрытьПоказатьЭлементыФормы("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуПромежуточныхИтогов", Истина);
			
				СкрытьПоказатьЭлементыФормы("дсАукционыВРаботеСписокВРаботеПодведениеПромежуточныхИтогов,дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуОкончательныхИтогов", Ложь);	
			Иначе
				СкрытьПоказатьЭлементыФормы(ЭлементыДляВзаимодействияСУчастниками(), Истина);
				
				СкрытьПоказатьЭлементыФормы("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуОкончательныхИтогов", Истина);
			
				СкрытьПоказатьЭлементыФормы("дсАукционыВРаботеСписокВРаботеПодведениеПромежуточныхИтогов,дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуПромежуточныхИтогов", Ложь);	
			КонецЕсли;	
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ВРаботе_ВсеКомандыУправления()

	масРез = Новый Массив;
	
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводНовойСтавки");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводИнформацииОбОтказеОтУчастия");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводИнформационногоСообщения");
	масРез.Добавить("дсАукционыВРаботеКонтекстноеМенюИзменить");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеОтправитьСообщениеУчастникам");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуПромежуточныхИтогов");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуОкончательныхИтогов");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеПодведениеПромежуточныхИтогов"); 
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеОтменитьАукцион");
	
	Возврат масРез;
	
КонецФункции

&НаКлиенте
Функция ПодведениеПромежуточныхИтогов_ЭлементыДляСкрытия()

	масРез = ЭлементыДляВзаимодействияСУчастниками();	
	
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуПромежуточныхИтогов");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеПерейтиКРасчетуОкончательныхИтогов");
	
	Возврат масРез;
	
КонецФункции

&НаКлиенте
Функция ЭлементыДляВзаимодействияСУчастниками()

	масРез = Новый Массив;
	
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводНовойСтавки");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеОтменитьАукцион");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводИнформацииОбОтказеОтУчастия");
	масРез.Добавить("дсАукционыВРаботеСписокВРаботеВводИнформационногоСообщения");
	масРез.Добавить("дсАукционыВРаботеКонтекстноеМенюИзменить");
		
	Возврат масРез;
	
КонецФункции	

&НаКлиенте
Процедура СкрытьПоказатьЭлементыФормы(пИменаЭлементов, пВидимость)
	
	Если ТипЗнч(пИменаЭлементов) = Тип("Строка") Тогда
		масИменаЭлементов = СтрРазделить(пИменаЭлементов, ",");
	ИначеЕсли ТипЗнч(пИменаЭлементов) = Тип("Массив") Тогда
		масИменаЭлементов = пИменаЭлементов;	
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ЭлМас Из масИменаЭлементов Цикл
		
		Элементы[ЭлМас].Видимость = пВидимость;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
